artillery/socketArtillery3.yml
config:
  target: 'http://localhost:4001'
  phases:
    - duration: 50  # 실행시간
      arrivalRate: 3 # 1초당 실행횟수
  engines:
    socketio-v3: { }
  payload:
    path: ./payloadData/UserToken.csv
    fields:
      - token

scenarios:
  - name: map location test
    engine: socketio-v3
    socketio-v3:
      extraHeaders:
        Authorization: "hello"
      headers:
          Authorization: "Hello"
    flow:
      - namespace: "/location"
        emit:
          channel: 'latlng'
          data:
            "lat": 37.5592
            "lng": 126.9397